
## Plan Result




<pre><code>Plan: 17 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;blob_router&#34;]
  * module.postgresql-staging.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql-staging.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql-staging.azurerm_postgresql_flexible_server_database.pg_databases[&#34;blob_router&#34;]
  * module.postgresql-staging.azurerm_resource_group.rg[0]
  * module.postgresql-staging.null_resource.set-user-permissions-additionaldbs[&#34;blob_router&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-09T11:41:08Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-DATABASE/1e877432a45644dc957e4315c2fabc59"
        name                    = "blob-router-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-09T11:41:08Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-HOST/6aa828f356264ec7b7edac57e53f7819"
        name                    = "blob-router-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-09T11:41:08Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PASS/7f3ae7fe77f54babb83858b88c3f123c"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-09T11:41:08Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PORT/258b796368ff4a5bae718e543eae24fa"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-09T11:41:08Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-USER/9a55d421809b4beca1bdcd742c21f873"
        name                    = "blob-router-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-staging-flexible-db-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-staging-flexible-db-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-staging-flexible-db-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-staging-flexible-db-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-staging-flexible-db-user"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "api_user"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "blob-router-flexible-postgres-db-v15-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "blob-router-flexible-postgres-db-v15-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["blob_router"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "blob_router"
      + server_id = (known after apply)
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "blob_router"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "blob-router-flexible-postgres-db-v15-staging-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + server_name         = "blob-router-flexible-postgres-db-v15-staging-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql-staging.azurerm_postgresql_flexible_server_database.pg_databases["blob_router"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "blob_router"
      + server_id = (known after apply)
    }

  # module.postgresql-staging.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "blob-router-flexible-postgres-db-v15-staging-data-aat"
      + tags     = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
    }

  # module.postgresql-staging.null_resource.set-user-permissions-additionaldbs["blob_router"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "blob-router-flexible-postgres-db-v15-staging"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 17 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2131,"Program":"tfcmt","SHA1":"","Vars":{}} -->